SnyUmd/Arduino_ESP32/Hct/Hct201_After/src/hctMain.cpp
#include <Arduino.h>
// #include <string>
// #include <WiFi.h>
#include <WebServer.h>
// #include <Wire.h>
#include <iostream>
#include <vector>
// #include <EEPROM.h>
#include <BluetoothSerial.h>
#include "module/initialize.h"
#include "module/defHct.h"
#include "module/common.h"
#include "module/Timer.h"
#include "module/wifiCtrl.h"
#include "module/ledCtrl.h"
#include "module/rx8035.h"
#include "module/BzCtrl.h"
#include "module/htu21d.h"
#include "module/i2cCtrl.h"
#include "module/motorCtrl.h"
#include "module/ESP32_eep.h"
#include "module/Arduino_Ini_Setup.h"

using namespace std;

ledCtrl LC;

void init();
void setHttpAction();
void setNowOpen(int open_time);
void setAfter(int next_time, int adjustment_time);
void setDevice(int contentNum);
void outputValue();
void outputTime();
string getTemp();
string getHumd();
void closeValve_Now();
int getNextTime();
void IRAM_ATTR setClosing();
void IRAM_ATTR afterOpenValve();

void taskMotor_W(void* arg);
void taskMotor_F(void* arg);

void IRAM_ATTR openMotorW();
void IRAM_ATTR openMotorF();
void IRAM_ATTR closeMotorW();
void IRAM_ATTR closeMotorF();
void IRAM_ATTR intervalStop();

void IRAM_ATTR onTimer();
void regularAction(deviceStatus& device, int& led_cnt, bool bl_food);
String GetResponsMessage(String target, String action, String item = "", String value = "");
int getNextTime(deviceStatus device);
void readEEP();
void modeSetting();
void wifiStatusReset();
void wifiStatusIntake();
String serialRead(BluetoothSerial& srBT, char c_end, long timeout);

//***************************************************************************************************************
//***************************************************************************************************************
//***************************************************************************************************************
void setup()
{
    sr.begin(115200);
    sr.println("----- START -----");
    //------------------------------------------------------------------
    esp_chip_info_t chip_info;
    esp_chip_info(&chip_info);

    printf("%dMB %s flash\n", spi_flash_get_chip_size() / (1024 * 1024),
    (chip_info.features & CHIP_FEATURE_EMB_FLASH) ? "embedded" : "external");

    printf("Free heap size: %d bytes\n", esp_get_free_heap_size());
    printf("Internal free heap size: %d bytes\n", esp_get_free_internal_heap_size());
    printf("Minimum free heap size: %d bytes\n", esp_get_minimum_free_heap_size());
    multi_heap_info_t info;
    heap_caps_get_info(&info, MALLOC_CAP_SPIRAM);
    uint32_t bytes = info.total_free_bytes + info.total_allocated_bytes;

    printf("PSRAM size: %d bytes\n", bytes);
    printf("Free PSRAM size: %d bytes\n", heap_caps_get_free_size(MALLOC_CAP_SPIRAM));
    //------------------------------------------------------------------

    sr.println("----- PORT setting -----");
    initPort();
    LC.ledFlash(PORT_LED_F, 5, 3);
    LC.ledFlash(PORT_LED_W, 5, 3);
    digitalWrite(PORT_LED_F, LED_OFF);
    digitalWrite(PORT_LED_W, LED_OFF);
    initI2C(wr);

    sr.println("----- Buzzer setting -----");
    InitBz();
    bzPowerOn();


//-------------------------------------------------------
    sr.println("----- EEPROM setting -----");
    EEP_Init(ep, eepSize);
    sr.println("----- WiFi status EEPROM Write -----");

    if(digitalRead(PORT_SW) == LOW) wifiStatusReset();
    wifiStatusIntake();

    modeSetting();
    
    wifiStatusIntake();
//-------------------------------------------------------
    readEEP();
    if(!wifiInit(WiFi, sr, wifiSts.ssid, wifiSts.pass, wifiSts.host_name, false))
    {
        sr.println("wifi networ error");
        modeSetting();
    }
    setHttpAction();
    sr.println("-----loop Start-----");
    
    // setVal.interval = 20;
    // operationReservation = enmRegularOppenning;
    // setAfter(setVal.interval, setVal.length);
    LC.ledFlash(PORT_LED_W, 5, 2);
    digitalWrite(PORT_LED_W, LED_OFF);
    LC.ledFlash(PORT_LED_F, 5, 2);
    digitalWrite(PORT_LED_F, LED_OFF);

    motorAction(MOTOR_OPEN, 20, false);
    motorAction(MOTOR_OPEN, 20, true);

    motorAction(MOTOR_CLOSE, 20, false);
    motorAction(MOTOR_CLOSE, 20, true);

    BzGoUp(5, 10);
    
    xTaskCreatePinnedToCore(taskMotor_W, "taskMotor_W", 4096, NULL, 1, NULL, 0);
    xTaskCreatePinnedToCore(taskMotor_F, "taskMotor_F", 4096, NULL, 1, NULL, 0);

    // xTaskCreatePinnedToCore(
    //        タスク名,
    //        "タスク名",
    //        スタックメモリサイズ,
    //        NULL,
    //        タスク優先順位,
    //        タスクハンドルポインタ,
    //        Core ID
    // );

    setTimerInterrupt(deviceSts_W.tClose, deviceSts_W.timerNumClose, closeMotorW);
    setTimerInterrupt(deviceSts_F.tClose, deviceSts_F.timerNumClose, closeMotorF);
    setTimerInterrupt(deviceSts_W.tOpen, deviceSts_W.timerNumOpen, openMotorW);
    setTimerInterrupt(deviceSts_F.tOpen, deviceSts_F.timerNumOpen, openMotorF);

}

//*************************************
void loop()
{
    // if(deviceSts_W.serverInit && deviceSts_F.serverInit) server.handleClient();
    server.handleClient();

    if(blModeSetting) ESP.restart();
}


//*************************************
void taskMotor_W(void* arg)
{
    int cntLED = 0;
    while(1){
        cntLED++;
        regularAction(deviceSts_W, cntLED, false);
    }
}

//*************************************
void taskMotor_F(void* arg)
{
    int cntLED = 0;
    while(1)
    {
        cntLED++;
        regularAction(deviceSts_F, cntLED, true);
    }
}

void regularAction(deviceStatus& device, int& led_cnt, bool bl_food)
{
    int len;
    bool ringed = false;
    bool canRing = true;
    // deviceStatus *p_device;
    // if(bl_food) p_device = &deviceSts_F;
    // else p_device = &deviceSts_W;

    if(device.oppenning && !device.opened)
    {
        // device.serverInit = false;
        if(bl_food && deviceSts_W.ringing) canRing = false;
        else if(deviceSts_F.ringing) canRing = false;
        else if(setRinging) canRing = false;
        else canRing = true;

        if (canRing && device.ring && !device.ringing)
        {
            device.ringing = true;
            // p_device = &device;
            setHctMelody(sr, device.melody.c_str());
            device.ringing = false;
            ringed = true;
            // p_device = &device;
        }

        digitalWrite(device.portLED, LED_ON);
        device.oppenning = false;
        device.opened = true;

