SnyUmd/Arduino_ESP32/Hct/Hct201_After/src/hctMain.cpp
                portLED = PORT_LED_F;
                // bzReceivedRing();
            }
            else
            {
                bzErrorSound();
                returnMessage = "error";
                break;
            }

            if(paramMelody != "" || paramRing == "true" || paramRing == "false")
            {
                if(paramMelody != ""){
                    device.melody = paramMelody;
                    sr.println(paramMelody);

                    if(getNextTime(device) < 10){
                        while(deviceSts_F.ringing || deviceSts_W.ringing);
                        setRinging = true;
                        setHctMelody(sr, device.melody.c_str());
                        setRinging = false;
                    }
                    returnMessage = GetResponsMessage(Position, "set", "melody", device.melody);
                }
                if(paramRing == "true" || paramRing == "false")
                {
                    if(paramRing == "true") device.ring = true;
                    else device.ring = false;
                    returnMessage = GetResponsMessage(Position, "set", "ring", paramRing);
                }
                bzReceivedRing();
                *p_device = device;
                // returnMessage = "successed";

            }
            // else if(paramLength != "") {
            //     device.length = atoi(paramLength.c_str());
            //     *p_device = device;
            //     bzReceivedRing();
            //     // returnMessage = "successed";
            //     returnMessage = GetResponsMessage(Position, "set", "length", to_string(device.length).c_str());
            // }
            else if(paramInterval == "0")
            {
                sr.println("interval stop");
                device.interval =  0;
                // stopTimerInterrupt(p_t);
                // timerEnd(p_t);
                timerAlarmDisable(device.tOpen);

                digitalWrite(device.portLED, LED_OFF);
                *p_device = device;
                bzReceivedRing();
                // returnMessage = "successed";
                returnMessage = GetResponsMessage(Position, "set", "interval", to_string(device.interval).c_str());
            }
            else if(paramInterval != "") {
                device.interval = atoi(paramInterval.c_str());
                if(device.interval < 10)device.interval = 10;
                startTimerInterrupt(device.tOpen, device.interval * 1000000, true);
                device.setTime = GetTime();
                digitalWrite(device.portLED, LED_ON);
                *p_device = device;
                bzReceivedRing();
                // returnMessage = "successed";
                returnMessage = GetResponsMessage(Position, "set", "interval", to_string(device.interval).c_str());
            }
            // else if(paramRing == "true" || paramRing == "false")
            // {
            //     if(paramRing == "true")
            //         device.ring = true;
            //     else
            //         device.ring = false;
            //     *p_device = device;
            //     bzReceivedRing();
            //     returnMessage = "successed";
            // }
            else
            {
                bzErrorSound();
                returnMessage = "error";
                break;
            }
            break;

        case enmAdjust://--------------------------------------------------
            // bool blF = false;
            // bool blLeft = false;
            if(paramTarget == "w")
            { 
                device = deviceSts_W;
                p_device = &deviceSts_W;
            }
            else if(paramTarget == "f")
            {
                device = deviceSts_F;
                p_device = &deviceSts_F;
            }
            else
            {
                bzErrorSound();
                returnMessage = "error";
                break;
            }

            if( device.opened == false && 
                device.oppenning == false && 
                device.closing == false)
            {
                bzReceivedRing();

                if(paramDirection == "l") device.adjustmentLeft = true;
                else device.adjustmentLeft = false;

                if(paramMotion != "") sscanf(paramMotion.c_str(), "%d", &device.adjustMotion);

                device.adjustment = true;
                *p_device = device;
                returnMessage = "successed";
            }
            else
            {
                bzErrorSound();
                returnMessage = "error";
            }
            break;
        // case enmWifi:
        //     break;
        case enmWifi://--------------------------------------------------
            if(paramItem == "ssid")
            {
                sr.println(paramValue && paramValue != "");
                returnMessage = paramValue;
                EEP_Write(ep, wifiSts.eep_address_ssid, paramValue);
                bzReceivedRing();
            }
            else if(paramItem == "pass")
            {
                sr.println(paramValue && paramValue != "");
                returnMessage = paramValue;
                EEP_Write(ep, wifiSts.eep_address_pass, paramValue);
                bzReceivedRing();
            }
            else if(paramItem == "hostname" && paramValue != "")
            {
                sr.println(paramValue);
                returnMessage = paramValue;
                EEP_Write(ep, wifiSts.eep_address_host_name, paramValue);
                bzReceivedRing();
            }
            // else if(paramItem == "setting")
            // {
            //     bzReceivedRing();
            //     returnMessage = "setting mode";
            //     modeSetting();
            // }
            else
            {
                // bzErrorSound();
                bzReceivedRing();
                returnMessage = "Move to setting mode";
                blModeSetting = true;
                // modeSetting();
            }
            break;
        case enmWF:
            if(server.hasArg("plain") == false);
            String body = server.arg("plain");
            // deserializeJson(jsonDocument, body);
            break;
    }
    server.send(200, "text/plain", returnMessage);
}

//*************************************
void outputValue()
{
    String returnMessage = "";
    String paramItem = server.arg("item");
    String paramTarget = server.arg("target");

    deviceStatus device;
    deviceStatus *p_device;

    String Position = "water";

