SnyUmd/Arduino_ESP32/Hct/Hct201_After/src/hctMain.cpp
    // if(paramSts == paramWord_get[enm_time])
    // {
    //     bzReceivedRing();
    //     struct tm nowTime = getTimeInf();
    //     char s[20] = {};
    //     arrangeTime(s, nowTime);
    //     returnMessage = s;
    //     // server.send(200, "text/plain", s);
    // }
    if(paramItem == paramWord_get[enm_temperture])
    {
        bzReceivedRing();
        returnMessage = getTemp().c_str();
    }
    else if(paramItem == paramWord_get[enm_humidity])
    {
        bzReceivedRing();
        returnMessage = getHumd().c_str();
    }
    // else if(paramItem == "dq")
    //     Bz_DragonQuest_Preface();
    else
    {
        if(paramTarget == "w")
        { 
            device = deviceSts_W;
            p_device = &deviceSts_W;
        }
        else if(paramTarget == "f")
        {
            device = deviceSts_F;
            p_device = &deviceSts_F;
            Position = "food";
        }
        else
        {
            bzErrorSound();
            returnMessage = "error";
            server.send(200, "text/plain", returnMessage);
            return;
        }
        if(paramItem == paramWord_get[enm_interval])
        {
            bzReceivedRing();
            // returnMessage = device.interval;
            returnMessage = GetResponsMessage(Position, "output", paramItem, to_string(device.interval).c_str());
        }
        else if(paramItem == paramWord_get[enm_ring])
        {
            bzReceivedRing();
            if(device.ring) returnMessage = GetResponsMessage(Position, "output", paramItem, "true");
            else returnMessage = GetResponsMessage(Position, "output", paramItem, "false");
        }
        else if(paramItem == paramWord_get[enm_melody])
        {
            bzReceivedRing();
            // returnMessage = device.melody;
            returnMessage = GetResponsMessage(Position, "output", paramItem, device.melody);
            setHctMelody(sr, device.melody.c_str());
            
        }
        else if(paramItem == paramWord_get[enm_next])
        {
            // sr.println(getNextTime(device));
            bzReceivedRing();
            // returnMessage = getNextTime(device);
            returnMessage = GetResponsMessage(Position, "output", paramItem, to_string(getNextTime(device)).c_str());
        }
        else if(paramItem == "settime")
        {
            bzReceivedRing();
            returnMessage = device.setTime;
            returnMessage = GetResponsMessage(Position, "output", paramItem, to_string(device.setTime).c_str());
        }
        else if(paramItem == paramWord_get[enm_all])
        {
            bzReceivedRing();
            // struct tm nowTime = getTimeInf();
            // arrangeTime(s, nowTime);
            // returnMessage = s;
            // returnMessage += "\r";
            // returnMessage += getTemp().c_str();
            // returnMessage += "\r";
            // returnMessage += getHumd().c_str();

            String ringVal = "";
            if(device.ring) ringVal = "true";
            else ringVal = "false";
            returnMessage += "[";
            returnMessage += GetResponsMessage(Position, "output", "interval", to_string(device.interval).c_str()) + ",";
            returnMessage += GetResponsMessage(Position, "output", "ring", ringVal) + ",";
            returnMessage += GetResponsMessage(Position, "output", "melody", device.melody) + ",";
            returnMessage += GetResponsMessage(Position, "output", "next", to_string(getNextTime(device)).c_str());
            returnMessage += "]";
        }
        else{
            bzErrorSound();
            returnMessage = errorMessage[enmStsError_get];
        }
    }
    server.send(200, "text/plain", returnMessage);
}

String GetResponsMessage(String target, String action, String item, String value)
{
    String resultMessage = "";
    resultMessage += "{";
    resultMessage += ResponsWord.Target + ":\"" + target + "\",";
    resultMessage += ResponsWord.Action + ":\"" + action + "\",";
    resultMessage += ResponsWord.Item + ":\"" + item + "\",";
    resultMessage += ResponsWord.Value + ":\"" + value + "\"";
    resultMessage += "}";
    return resultMessage;
}

//*************************************
void IRAM_ATTR openMotorW()
{
    deviceSts_W.setTime = GetTime();
    deviceSts_W.oppenning = true;
} 

//*************************************
void IRAM_ATTR openMotorF()
{
    deviceSts_F.setTime = GetTime();
    deviceSts_F.oppenning = true;
} 

//*************************************
void IRAM_ATTR closeMotorW()
{
    deviceSts_W.closing = true;
} 
//*************************************
void IRAM_ATTR closeMotorF()
{
    deviceSts_F.closing = true;
} 

//*************************************
void IRAM_ATTR intervalStop(){ } 

//*************************************
string getTemp()
{
    float fTemp = readTempHTD21D(wr);
    sr.println(fTemp);
    return to_string(fTemp).substr(0, 5);
}

//*************************************
string getHumd()
{
    float fHumd = readHumdHTD21D(wr);
    return to_string(fHumd).substr(0, 5);
}

//*************************************
int getNextTime(deviceStatus device)
{
    if(device.interval == 0)
    {
        return 0;
    }
    else
    {
        long nowT = GetTime();
        long setT = device.setTime;
        sr.print("set time：");
        sr.println(setT);
        sr.print("now time：");
        sr.println(nowT);
        sr.print("result：");
        sr.println(device.interval - ((nowT - setT)/1000));
        
        if(nowT < setT) nowT + 4294967295;
        return device.interval - ((nowT - setT)/1000);
    }
}

void readEEP()
{
    sr.println("----- Read EEPROM-----");
    sr.print("ssid : ");
    sr.println(EEP_Read(ep, wifiSts.eep_address_ssid, '*', ep.length()));
    sr.print("pass : ");
    sr.println(EEP_Read(ep, wifiSts.eep_address_pass, '*', ep.length()));
    sr.print("host name : ");
    sr.println(EEP_Read(ep, wifiSts.eep_address_host_name, '*', ep.length()));
}


// }
//*************************************
// void IRAM_ATTR setClosing_Regular()
// {
//     deviceSts.closingRun = true;
// }

//*************************************
// void IRAM_ATTR afterOpenValve()
// {
//     openTime = setVal.length * 1000000;
//     deviceSts.regularOppenning = true;
// }

