SnyUmd/Arduino_ESP32/Hct/Hct201_After/src/hctMain.cpp
void wifiStatusReset()
{
    EEP_Write(ep, wifiSts.eep_address_ssid ,SSID);
    EEP_Write(ep, wifiSts.eep_address_pass ,PASS);
    EEP_Write(ep, wifiSts.eep_address_host_name ,HOST_NAME);
    wifiStatusIntake();
    sr.println("Reset wifi status");
}

void wifiStatusIntake()
{
    wifiSts.ssid = EEP_Read(ep, wifiSts.eep_address_ssid, '*', ep.length());
    wifiSts.pass = EEP_Read(ep, wifiSts.eep_address_pass, '*', ep.length());
    wifiSts.host_name = EEP_Read(ep, wifiSts.eep_address_host_name, '*', ep.length());
}

long timeSetting = GetTime();
const long endTime = 30000;
// *************************************
void modeSetting()
{
    BluetoothSerial srBT;
    HardwareSerial Serial00 = Serial;

    timeSetting = GetTime();
    sr.println("********* Setting mode *********");
    BzGoDown(5, 10);
    digitalWrite(PORT_LED_W, LED_ON);
    // digitalWrite(PORT_LED_F, LED_ON);

    //Bluetoothのセット--------------------
    // if (!mESP32_BLSerial_Set(srBT, "BT_um", Serial00))
    if(!srBT.begin("BT32"))
    {
        //digitalWrite(BLUE_LED, 0);
        sr.print("-----Bluetooth err-----");
        while (true);
    }
    else
    {
        sr.print("-----Bluetooth set-----");

        //digitalWrite(BLUE_LED, 1);
    }
    String readBuf = "";

    int* p_address;
    String* p_sBuf;
    while (true)
    {
        timeSetting = GetTime();
        
        srBT.println("==================");
        srBT.println("s : wifi start");
        srBT.println("r : wifi status read");
        srBT.println("w : wifi status write");
        srBT.println("------------------");
        srBT.print("-> ");
        readBuf = serialRead(srBT, '\n', 20000);

        if(readBuf == "")
        {
            if(CheckElapsedTime(timeSetting, 20000)) 
            {
                srBT.println("setting time out");
                sr.println("setting time out");
                break;
            }
            else continue;
        }
        else if(readBuf.indexOf(BTcommand[enm_start]) >= 0) break;
        else if(readBuf.indexOf(BTcommand[enm_read]) >= 0)
        {
            srBT.print("ssid : ");
            srBT.println(wifiSts.ssid);
            srBT.print("pass : ");
            srBT.println(wifiSts.pass);
            srBT.print("hostname : ");
            srBT.println(wifiSts.host_name);
            srBT.println("");
        }
        else if(readBuf.indexOf(BTcommand[enm_write]) >= 0)
        {
            srBT.println("1 : ssid");
            srBT.println("2 : pass");
            srBT.println("3 : hostname");
            srBT.println("------------------");
            srBT.print("number -> ");
            // timeSetting = GetTime();
            readBuf = serialRead(srBT, '\n', 10000);
            // timeSetting = GetTime();
            if(readBuf == "") continue;
            else if(readBuf == "1")
            {
                p_address = &wifiSts.eep_address_ssid;
                p_sBuf = &wifiSts.ssid;
            }
            else if(readBuf == "2"){
                p_address = &wifiSts.eep_address_pass;
                p_sBuf = &wifiSts.pass;
            } 
            else if(readBuf == "3")
            {
                p_address = &wifiSts.eep_address_host_name;
                p_sBuf = &wifiSts.host_name;
            }
            else continue;

            srBT.println("------------------");
            srBT.print("value -> ");
            // timeSetting = GetTime();
            readBuf = serialRead(srBT, '\n', 10000);
            if(readBuf == "") continue;
            else if(readBuf == "") continue;
            else
            {
                EEP_Write(ep, *p_address, readBuf);
                *p_sBuf = readBuf;
                srBT.println("completion");
            }
        }
        // timeSetting = GetTime();
    }

    blModeSetting = false;
    digitalWrite(PORT_LED_W, LED_OFF);
    digitalWrite(PORT_LED_F, LED_OFF);
}


//*************************************
String serialRead(BluetoothSerial& srBT ,char c_end, long timeout)
{
    String result = "";
    timeSetting = GetTime();
    while (true)
    {
        if(CheckElapsedTime(timeSetting, timeout)) 
        {
            srBT.println("time out");
            sr.println("time out");
            return "";
        }
        if(srBT.available())
        {
            timeSetting = GetTime();
            result += srBT.readString();
            if(result.indexOf(c_end) >= 0)
            {
                result.remove(result.length()-2, 2);//crlfを削除
                return result;
            }
        }
    }
}

//*************************************
//現在時刻取得
void outputTime()
{
    bzReceivedRing();
    struct tm nowTime = getTimeInf();
    char s[20] = {};
    arrangeTime(s, nowTime);
    server.send(200, "text/plain", s);
}